In [2]:
import pandas as pd
import numpy as np

In [68]:
filename = "data/5.-Jumbled-up-Customers-Details.xlsx"
data = pd.read_excel(filename,header=None)

In [69]:
data.head()

                                                   0
0  Name Hussein Hakeem Address Number 22 Fioye Cr...
1  Name Arojoye Samuel Address 11 Omolade Close O...
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...
3  Name Susan Nwaimo Address Number 58 Yaba Stree...
4  Name Ajao Opeyemi Address No12 Olubunmi Street...

In [77]:
cols = ["Name","Address","Age","Gender"]

In [79]:
for key in cols:
    data[0] = data[0].str.replace(key,'_')

In [80]:
data.head()

                                                   0
0  _ Hussein Hakeem _ Number 22 Fioye Crescent Su...
1  _ Arojoye Samuel _ 11 Omolade Close Omole Esta...
2    _ Alex Ezurum _ 1 Adamu Lane, Abuja _ 14 _ Male
3  _ Susan Nwaimo _ Number 58 Yaba Street, Kaduna...
4  _ Ajao Opeyemi _ No12 Olubunmi Street, Abeokut...

In [118]:
segments = data[0].str.split("_")
fixed = {
    key:value
    for key in cols
    for value in segments[1:]
    # for i in range(len(value))
}

In [120]:
segments = segments.to_list()

In [130]:
segments[1][:]

['',
 ' Arojoye Samuel ',
 ' 11 Omolade Close Omole Estate Lagos ',
 ' 16 ',
 ' Male']

In [126]:
["Name","Address","Age","Gender"]
for value in segments:
    data["Name"] = data["Name"].append(value[1])
    data["Address"] = data["Name"].append(value[2])
    data["Age"] = data["Name"].append(value[3])
    data["Gender"] = data["Name"].append(value[4])

TypeError: cannot concatenate object of type '<class 'str'>'; only Series and DataFrame objs are valid

In [125]:
data.head()

,0,Name,Address,Age,Gender
0,_ Hussein Hakeem _ Number 22 Fioye Crescent Su...,Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female
1,_ Arojoye Samuel _ 11 Omolade Close Omole Esta...,Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female
2,"_ Alex Ezurum _ 1 Adamu Lane, Abuja _ 14 _ Male",Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female
3,"_ Susan Nwaimo _ Number 58 Yaba Street, Kaduna...",Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female
4,"_ Ajao Opeyemi _ No12 Olubunmi Street, Abeokut...",Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female